Repository: jmnavarro/liferay-screens-themes
Catalog: NewAge/Resources/*.lproj/newage.strings
Languages: de

# newage-signup-title
source: SIGN UP
de: ANMELDEN

# newage-signup-first-name
source: First Name
de: Name

# newage-signup-last-name
source: Last Name
de: Nachname

# newage-signup-email
source: Email Address
de: E-Adresse

# newage-signup-password
source: Password
de: Kennwort

# newage-signup-job
source: Job Title
de: Jobtitel

# newage-signup-name-title
source: YOUR NAME
de: IHR NAME

# newage-signup-email-title
source: EMAIL ADDRESS
de: E-ADRESSE

# newage-signup-password-title
source: PASSWORD
de: KENNWORT

# newage-signup-job-title
source: JOB TITLE
de: JOBTITEL

# newage-signup-name-error
source: Please, fill both first and last name
de: Bitte Vor- und Nachname eingeben

# newage-signup-email-error
source: Please, enter a valid address
de: Bitte gültige E-Adresse eingeben

# newage-signup-job-error
source: Please, enter your job title
de: Bitte gültige Jobtitel eingeben

# newage-signup-password-error-1
source: Too weak password
de: Zu schwach Kennwort

# newage-signup-password-error-2
source: Too weak password, still
de: Zu schwach Kennwort, noch

# newage-signup-password-error-3
source: Valid enough password
de: Gültig genug Kennwort

# newage-signup-password-error-4
source: You password is secure!
de: Ihr Kennwort ist sicher!
